Revit 2027 API
AreaBasedLoadData.Current Property
 The current of the area based load .
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Current { get; }
Public ReadOnly Property Current As Double
	Get
public:
property double Current {
	double get ();
}
member Current : float with get
Property Value
Double
See Also
Reference
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace